sts-request.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><Action xmlns="http://www.w3.org/2005/08/addressing">http://docs.oasis-open.org/ws-sx/ws-trust/200512/RST/Issue</Action><MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:f4195220-66cd-45ca-aa16-645f3e1a798d</MessageID><To xmlns="http://www.w3.org/2005/08/addressing">https://iamwse.upvsfix.gov.sk:8581/sts/wss11x509</To><ReplyTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/anonymous</Address></ReplyTo><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="true"><wsu:Timestamp wsu:Id="TS-7a2ab94e-a14a-4b12-9f97-da6730ab7744"><wsu:Created>2026-02-03T07:58:02.837Z</wsu:Created><wsu:Expires>2026-02-03T08:03:02.837Z</wsu:Expires></wsu:Timestamp><wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="X509-075b03e7-f0bd-4fab-a092-3fa67ffc0dea">MIIC0jCCAbqgAwIBAgIJAIIpWbYMSFPBMA0GCSqGSIb3DQEBDQUAMBcxFTATBgNVBAMTDGljby04MzEzMDA0MTAeFw0yNDA5MTAxMjUxMDZaFw0yNjA5MTAxMjUxMDZaMBcxFTATBgNVBAMTDGljby04MzEzMDA0MTCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBAK8OcM4zLitTQsn5lRjTdUt7gBwmSZlvFjmpqZV8k8A3CokrUID4hzJ0gGdd6xIEsIuL8U6v/a3Y4ux2cJfFbQ5be5lpP3sPtJ0rx+/wh0uCmrPr0YtahZidN0JH1L8AQEV0bH5KCnkXtt41a/S/hpbwhcJWAIfvaynsQDlnHGmL6Mer2njPgLVE5ovQJOBQnsgLZsCJEIS3aXJFv/1cn9rz8uX39R3x8rBGGfNBdbM10RWtN5MQ3RXIto5Nv3PSOD7UcUqaY8XAm9pGsY6owGiQtq/i81OnUElfy8ZqdUbRsqxoM6gvZUsPdT/togaewnQ2zG/z7wNFZUURIShnlMECAwEAAaMhMB8wHQYDVR0OBBYEFMwIshe1F9t18VJoKMEms+Tw0C9zMA0GCSqGSIb3DQEBDQUAA4IBAQAowYdbqZePFp3qKh1tn+bBjiGVTJF90WKkP5mbI9ilKjjZXFZ5MkWc83t6tnk7goTDS2PjlvT9LofDPh+Mrf0GEwYds36UCYM/mHry76BUEq8FdEOYxbza/4OCmZAJ86tH2F1YhQ6TwurZBEuNWOK2S/MEt2puujcwBozWOLs2sOtq0r5Wyn5y5EVGCivmyn/AGpaB0uZkb18VkJ5pyt2Fp0w2K6OjvopuRLF9Aq7A5qMDO11SfwCpNY7KQRTVVnqqv5witaGpsj4yqgTVkxPrrXXAie2U3wsRoOEpECIBNTZ35JJ5dMASuDYSmELDwD907+9KlVttKyRYY+W+C2NA</wsse:BinarySecurityToken><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-8763e60d-3911-4128-b4eb-bed0c5f2c264"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#TS-7a2ab94e-a14a-4b12-9f97-da6730ab7744"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="wsse soap"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>HYQDuAbqtXd7hoX00vLYSloZmLs=</ds:DigestValue></ds:Reference><ds:Reference URI="#_115c0d1d-39b9-4cf4-866b-44d1d086f078"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>1lfGESpPb7cFeeRxJ+Nh/Mi2cJo=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>JiOvqDkeKSubCuVYVOFMGpoYZ/M14xD/pznl8wnOuMYXHBoawQLDA8jYjBOCG0BGHvH4o1hnMHvpOz9phh4wZhpgNL70VAExgMb3HIauWTt17Q1PK2sSssuSwZmMwHeBVzMiUXpF2SpAJRz5YQ/KWC0qdyCiA2rE1elwZ7tiG7SfOz1vQQEWuEUmdLeDppsWg6y5emD25svbe3AGlAV1oZZoSbcEYHIp7ft+4VE5t+H/MInbD6fdurn43FJjuI6o9XpcfAeqVWH72NoGcxdivwpSEMzYDoGAM3RzrjW+blzn8z9JxQD1FbftGdSJnC8sBTPJR9sslMe7Awwh7Dn9XA==</ds:SignatureValue><ds:KeyInfo Id="KI-f462b628-e019-4c87-9e03-ee87b0b93d3d"><wsse:SecurityTokenReference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="STR-cb0744a3-04ff-4bba-958a-91144c45ae0c"><wsse:Reference URI="#X509-075b03e7-f0bd-4fab-a092-3fa67ffc0dea" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soap:Header><soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="_115c0d1d-39b9-4cf4-866b-44d1d086f078"><wst:RequestSecurityToken xmlns:wst="http://docs.oasis-open.org/ws-sx/ws-trust/200512"><wst:SecondaryParameters><trust:TokenType xmlns:trust="http://docs.oasis-open.org/ws-sx/ws-trust/200512">http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLV2.0</trust:TokenType><trust:KeyType xmlns:trust="http://docs.oasis-open.org/ws-sx/ws-trust/200512">http://docs.oasis-open.org/ws-sx/ws-trust/200512/Bearer</trust:KeyType></wst:SecondaryParameters><wst:RequestType>http://docs.oasis-open.org/ws-sx/ws-trust/200512/Issue</wst:RequestType><wsp:AppliesTo xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy"><wsa:EndpointReference xmlns:wsa="http://www.w3.org/2005/08/addressing"><wsa:Address>https://eschranka.upvsfixnew.gov.sk/EKSService.svc</wsa:Address></wsa:EndpointReference></wsp:AppliesTo></wst:RequestSecurityToken></soap:Body></soap:Envelope>